//==============================================================================
//              Cooperative MultiTasking system
//                    CMT system
// By Alexander Sibilev
//==============================================================================
uint32 cmtKbdGetKey();      //Возвращает код нажатой клавиши и сбрасывает клавишу (если нет нажатия - ожидает нажатия)
uint32 cmtKbdPeekKey();     //Возвращает код нажатой клавиши (0-если нет нажатия)

uint32 cmtHalKbdGetPress(); //Возвращает код клавиатуры

void   cmtKbdTask();        //Функция задачи опроса клавиатуры