//==============================================================================
//              Cooperative MultiTasking system
//                    CMT system
// By Alexander Sibilev
//==============================================================================

//==============================================================================
//-------------  Календарь -----------------------------------------------------

//! Часы и календарь в упакованном формате - количество секунд с 1.01.2010


//! Часы и календарь
struct CmtSystemTime {
  uint16 mYear;            //!< Год
  uint8  mMonth;           //!< Месяц (1-январь, 2-февраль ...)
  uint8  mDayOfWeek;       //!< День недели (0-понедельник, 1-вторник ...)
  uint8  mDay;             //!< День месяца (1-31)
  uint8  mHour;            //!< Часы (0-23)
  uint8  mMinute;          //!< Минуты (0-59)
  uint8  mSecond;          //!< Секунды (0-59)

  CmtSystemTime();

  void   GetSystem();      //!< Получить системное время и дату
  void   SetSystem();      //!< Установить системное время и дату
  uint32 FileTimeFormat(); //!< Получить в формате даты и времени файла
  uint16 FFTime();         //!< Получить в формате времени файла
  uint16 FFDate();         //!< Получить в формате даты файла
  uint32 PackedFormat();   //!< Получить время и дату в упакованном формате
  void   UnPack( uint32 ); //!< Распаковать время и дату
  };

void cmtInitSystemTime();


